nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone (保持不变)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 2, C3k2, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]  # 8
  - [-1, 1, SPPF, [1024, 5]]  # 9
  - [-1, 2, C2PSA, [1024]]  # 10


head:

  - [1, 1, Conv, [512]]  # 11: P2/4 (512 ch)
  - [3, 1, Conv, [512]]  # 12: P3/8 (512 ch)
  - [5, 1, Conv, [512]]  # 13: P4/16 (512 ch)
  - [10, 1, Conv, [512]] # 14: P5/32 (512 ch)


  - [-1, 1, MSFA, []]  # 15: P5->P4
  - [[15, 13], 1, PAF, [1]]  # 16: 融合P5↑ + P4
  - [-1, 3, C3k2, [512, False]]  # 17: 新P4 (512通道)

  - [-1, 1, MSFA, []]  # 18: P4->P3
  - [[18, 12], 1, PAF, [1]]  # 19: 融合P4↑ + P3
  - [-1, 3, C3k2, [512, False]]  # 20: 新P3 (512通道)

  - [-1, 1, MSFA, []]  # 21: P3->P2
  - [[21, 11], 1, PAF, [1]]  # 22: 融合P3↑ + P2
  - [-1, 3, C3k2, [512, False]]  # 23: 新P2 (512通道)


  - [23, 1, Conv, [512, 3, 2]]  # 24: P2->P3 (下采样)
  - [[24, 20], 1,PAF, [1]]  # 25: 融合P2↓ + P3
  - [-1, 3, C3k2, [512, True]]  # 26: 更新P3 (512通道)

  - [26, 1, Conv, [512, 3, 2]]  # 27: P3->P4 (下采样)
  - [[27, 17], 1, PAF, [1]]  # 28:
  - [-1, 3, C3k2, [1024, True]]  # 29: 更新P4 (1024通道)


  - [23, 1, Conv, [512, 1, 1]]  # 30: 调整P2通道数到512
  - [26, 1, Conv, [512, 1, 1]]  # 31: 调整P3通道数到512
  - [29, 1, Conv, [1024, 1, 1]] # 32: 调整P4通道数到1024
  - [[30, 31, 32], 1, AMSI, [512, 0]]
  - [[30, 31, 32], 1, AMSI, [512, 1]]
  - [[30, 31, 32], 1, AMSI, [1024, 2]]


  - [33, 1, C3k2, [512, False]]  # 36:
  - [34, 1, C3k2, [512, False]]  # 37:
  - [35, 1, C3k2, [1024, False]]  # 38
  - [[36, 37, 38], 1, Detect, [nc]]  # 39: Detect(P2, P3, P4)